app/views/users/show.html.erb

  <div class="post">
    <% @user.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", "1"]]

 <h3>いいねしている投稿</h3>
<% @user.liked_posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", "1"]]