app/views/posts/index.html.erb

      <% @search_posts.each do |post| %>
        <% @user = User.find_by(id: post.user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]