app/views/posts/search.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <% @posts.each do |post| %>
        <% @user = User.find_by(id: post.user_id) %>