app/views/posts/show.html.erb

      <% end %>
      <p><%= @post.likes.count %>名がいいね</p>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 1]]

      <% end %>
      <p><%= @post.likes.count %>名がいいね</p>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 2]]

   <hr>
    <% user = User.find_by(id: comment.user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]