app/views/posts/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
   <hr>
    <% user = User.find_by(id: comment.user_id) %>