app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("post_id", "comment", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["post_id", 1], ["comment", "ss"], ["created_at", "2020-08-30 00:46:57.275829"], ["updated_at", "2020-08-30 00:46:57.275829"], ["user_id", 1]]
---
  def create
    post = Post.find(params[:post_id])
    @comment = post.comments.build(comment_params)
    @comment.user_id = current_user.id
    @post = @comment.post
    if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? LIMIT ?  [["post_id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
---
    def destroy
      @comment = Comment.find_by(id: params[:post_id])
      @comment.destroy