app/controllers/posts_controller.rb

  def index
    @posts = Post.page(params[:page]).per(15)
---
SELECT "posts".* FROM "posts"

  def show
    @posts = Post.all
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def destroy
    post = Post.find(params[:id])
    post.delete
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 28]]