app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.page(params[:page]).per(15).order(created_at: :desc)

INSERT INTO "posts" ("title", "created_at", "updated_at", "image", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "あああ"], ["created_at", "2020-08-29 11:43:01.718948"], ["updated_at", "2020-08-29 11:43:01.718948"], ["image", "20200829204301.jpg"], ["user_id", "1"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", "1"], ["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @posts = Post.all
    @post = Post.find_by(id: params[:id])
    @user = User.find_by(id: @post.user_id)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 41], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def destroy
    post = Post.find(params[:id])
    post.delete

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", "1"], ["id", 1], ["LIMIT", 1]]
---
  def set_current_user_post
    @post = current_user.posts.find(params[:id])